In [2]:
import pandas as pd
import numpy as np
import random

## Create DataFrames

pd.read_csv(filename) | From a CSV file

pd.read_table(filename) | From a delimited text file (like TSV)

pd.read_excel(filename) | From an Excel file

pd.read_sql(query, connection_object) | Read from a SQL table/database

pd.read_json(json_string) | Read from a JSON formatted string, URL or file.

pd.read_html(url) | Parses an html URL, string or file and extracts tables to a list of 
dataframes

pd.read_clipboard() | Takes the contents of your clipboard and passes it to read_table()

pd.DataFrame(dict) | From a dict, keys for columns names, values for data as lists

In [38]:
# Loading a data frame from a CSV
salesDataDf = pd.read_csv("SalesData.csv",low_memory=False)
display(salesDataDf)

    Region  Country Product  WK_1  WK_2  WK_3  Wk_4
0  America      USA  Laptop  1241  1160  1929  1174
1  America      USA   Phone  1098  1092  1089  1819
2  America   Canada  Laptop  1441  1099  1950  1394
3  America   Canada   Phone  1990  1057  1656  1060
4   Europe  Belgium  Laptop  1084  1116  1002  1566
5   Europe  Belgium   Phone  1574  1958  1793  1213
6   Europe  Finland  Laptop  1325  1374  1300  1579
7   Europe  Finland   Phone  1347  1736  1782  1921

In [39]:
salesdf1 = pd.read_excel("SalesData.xlsx")
display(salesdf1)

    Region  Country Product  WK_1  WK_2  WK_3  Wk_4
0  America      USA  Laptop  1241  1160  1929  1174
1  America      USA   Phone  1098  1092  1089  1819
2  America   Canada  Laptop  1441  1099  1950  1394
3  America   Canada   Phone  1990  1057  1656  1060
4   Europe  Belgium  Laptop  1084  1116  1002  1566
5   Europe  Belgium   Phone  1574  1958  1793  1213
6   Europe  Finland  Laptop  1325  1374  1300  1579
7   Europe  Finland   Phone  1347  1736  1782  1921

In [29]:
#Create a data frame from list of dictionaries
regionCountry = {"AMR":["USA","Canada"],"EUROPE":["Austria","Belgium"]}
cars = ["Audi","BMW","Mercedes"]
months = ["Jan","Feb","Mar"]
salesData = []
for region,countries in regionCountry.items():
    for country in countries:
        for car in cars:
            salesRecord = {"region":region,"country":country,"car":car}
            for month in months:
                salesRecord[month] = random.randint(100,2000)
             
            salesData.append(salesRecord)
            
df1 = pd.DataFrame(salesData)
display(df1)

    region  country       car   Jan   Feb   Mar
0      AMR      USA      Audi   902  1159  1629
1      AMR      USA       BMW  1646  1690  1107
2      AMR      USA  Mercedes  1616  1530  1855
3      AMR   Canada      Audi   100   892   110
4      AMR   Canada       BMW   629  1356  1641
5      AMR   Canada  Mercedes  1269  1689  1936
6   EUROPE  Austria      Audi   170  1323   299
7   EUROPE  Austria       BMW  1065  1392  1554
8   EUROPE  Austria  Mercedes   582  1819   850
9   EUROPE  Belgium      Audi  1906  1563  1506
10  EUROPE  Belgium       BMW  1846  1351   314
11  EUROPE  Belgium  Mercedes   647  1410   747

In [3]:
# Create DataFrame from a List
seasons = ['Winter','Spring','Summer','Fall']
df2 = pd.DataFrame(seasons)
print(df2)

        0
0  Winter
1  Spring
2  Summer
3    Fall

In [10]:
# Create a DataFrame from an Array of Array
data = [[100,200,300],
        [400,500,600],
        ['John','Jane','Mary','Jin']
       ]
df3 = pd.DataFrame(data,index=[1,2,3],columns=['a','b','c','d'])
print(df3)

      a     b     c     d
1   100   200   300  None
2   400   500   600  None
3  John  Jane  Mary   Jin

In [13]:
# Create a multi index data frame
df = pd.DataFrame(
{
    "a":[100,200,300],
    "b":[200,300,400],
    "c":[400,500,600]
}, index = pd.MultiIndex.from_tuples(
[('d', 1), ('d', 2),
          ('e', 2)], names=['n', 'v']))
print(df)

       a    b    c
n v
d 1  100  200  400
  2  200  300  500
e 2  300  400  600

In [34]:
# Creating a DataFrame by passing an arrays of values and an array of column header names:
df4 = pd.DataFrame([['Debasis Das',100],['John Doe',98],['Jane Doe',93]], columns = ["name","score"],dtype = float)
display(df4)

          name  score
0  Debasis Das  100.0
1     John Doe   98.0
2     Jane Doe   93.0

In [30]:
# Create a DataFrame from a Dictionary:
dictionary = {"names":["John Doe","Jane Doe","Mary Jane"], "score":[90,91,93]}
df5 = pd.DataFrame(dictionary)
display(df5)

       names  score
0   John Doe     90
1   Jane Doe     91
2  Mary Jane     93

In [31]:
# Create a DataFrame from a List of Dictionaries:

listOfDict = [{"names":"John Doe", "age":30},{"names":"Jane Doe", "age":10, "score":98.0}]
df6 = pd.DataFrame(listOfDict)
display(df6)

      names  age  score
0  John Doe   30    NaN
1  Jane Doe   10   98.0

In [32]:
# Add a column to the DataFrame based on a condition:

df7 = pd.DataFrame({'Score':[100,20,30,80,90]})
print(df7)
df7.loc[df7.Score <= 80, "Grade"] = "B"
df7.loc[df7.Score > 80, "Grade"] = "A"
df7.loc[df7.Score < 35, "Grade"] = "F"
display(df7)

   Score
0    100
1     20
2     30
3     80
4     90

   Score Grade
0    100     A
1     20     F
2     30     F
3     80     B
4     90     A

In [33]:
# Creating a DataFrame from a numpy array:

df8 = pd.DataFrame(np.random.randint(low=80, high=100), columns=['Monday', 'Tuesday', 'Wednesday', 'Thursday', 'Friday'],index=['Temp Morning', 'Temp Afternoon', 'Temp Evening'])
display(df8)

                Monday  Tuesday  Wednesday  Thursday  Friday
Temp Morning        81       81         81        81      81
Temp Afternoon      81       81         81        81      81
Temp Evening        81       81         81        81      81

In [27]:
# Creating a DataFrame with Random Values in few columns

salesData = {"Region":["Americas","Americas","Americas","Americas","Europe","Europe","Europe","Europe"],
 "Country":["USA","USA","Mexico","Mexico","Belgium","Belgium","Finland","Finland"],
 "Product":["Phone","TV","Phone","TV","Phone","TV","Phone","TV"],
 "wk1":np.random.uniform(1000,2000,8),
 "wk2":np.random.uniform(1000,2000,8),
 "wk3":np.random.uniform(1000,2000,8)
 }
salesDF = pd.DataFrame(salesData)
display(salesDF)

     Region  Country Product          wk1          wk2          wk3
0  Americas      USA   Phone  1973.187898  1557.539059  1402.076121
1  Americas      USA      TV  1240.621411  1833.512090  1442.117514
2  Americas   Mexico   Phone  1533.127965  1331.818344  1879.996337
3  Americas   Mexico      TV  1515.425316  1598.531971  1556.312956
4    Europe  Belgium   Phone  1456.536438  1267.782771  1568.822641
5    Europe  Belgium      TV  1613.961213  1627.800694  1809.022211
6    Europe  Finland   Phone  1456.093579  1293.921622  1324.606603
7    Europe  Finland      TV  1612.657080  1861.630062  1747.256899

In [21]:
# Adding New Columns to an Existing DataFrame:

salesDF["Total"] = salesDF['wk1'] + salesDF['wk2'] + salesDF['wk3']
salesDF["Total (K)"] = salesDF["Total"] /1000
display(salesDF)

,Region,Country,Product,wk1,wk2,wk3,Total,Total (K)
0,Americas,USA,Phone,1475.304961,1091.402477,1045.542887,3612.250325,3.612250
1,Americas,USA,TV,1314.912464,1164.304088,1664.291345,4143.507897,4.143508
2,Americas,Mexico,Phone,1492.186909,1298.255011,1063.034367,3853.476287,3.853476
3,Americas,Mexico,TV,1550.032698,1218.621335,1879.197327,4647.851360,4.647851
4,Europe,Belgium,Phone,1575.474727,1402.714552,1389.045910,4367.235189,4.367235
5,Europe,Belgium,TV,1572.407457,1481.469950,1324.571604,4378.449011,4.378449
6,Europe,Finland,Phone,1158.077661,1777.562912,1600.895133,4536.535707,4.536536
7,Europe,Finland,TV,1957.284728,1570.900052,1869.105173,5397.289953,5.397290

In [22]:
# Creating a DataFrame using Assign Function
# Assign returns a copy of the data frame as a new object with the new columns added to the original data frame.
salesDF1 = salesDF[["Region","Country","Product","wk1"]]
salesDF2 = salesDF1.assign(week1_k=lambda x: salesDF1['wk1']/1000)
display(salesDF2)

     Region  Country Product          wk1   week1_k
0  Americas      USA   Phone  1475.304961  1.475305
1  Americas      USA      TV  1314.912464  1.314912
2  Americas   Mexico   Phone  1492.186909  1.492187
3  Americas   Mexico      TV  1550.032698  1.550033
4    Europe  Belgium   Phone  1575.474727  1.575475
5    Europe  Belgium      TV  1572.407457  1.572407
6    Europe  Finland   Phone  1158.077661  1.158078
7    Europe  Finland      TV  1957.284728  1.957285

## Create a DataFrame by merging two DataFrames

In [23]:
data1 = {"Country":["USA","Mexico","Brazil"],"Jan_Sales":[1000,2000,3000]}
data2 = {"Country":["Canada","Mexico","Brazil","Belgium"],"Feb_Sales":[4000,5000,6000,7000]}
df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)
#Pandas merge function can automatically detect which columns are common between the dataframes 
#Pandas will use the common columns to merge the two dataframes
print(df1)
print(df2)

  Country  Jan_Sales
0     USA       1000
1  Mexico       2000
2  Brazil       3000
   Country  Feb_Sales
0   Canada       4000
1   Mexico       5000
2   Brazil       6000
3  Belgium       7000

In [24]:
#Inner Merge
df4 = df1.merge(df2,how='inner')
display(df4)

  Country  Jan_Sales  Feb_Sales
0  Mexico       2000       5000
1  Brazil       3000       6000

In [25]:
#Outer Merge
df5 = df1.merge(df2,how='outer')
display(df5)

   Country  Jan_Sales  Feb_Sales
0      USA     1000.0        NaN
1   Mexico     2000.0     5000.0
2   Brazil     3000.0     6000.0
3   Canada        NaN     4000.0
4  Belgium        NaN     7000.0

In [26]:
#Left Merge
df6 = df1.merge(df2,how='left')
display(df6)

  Country  Jan_Sales  Feb_Sales
0     USA       1000        NaN
1  Mexico       2000     5000.0
2  Brazil       3000     6000.0

In [28]:
#Right Merge
df7 = df1.merge(df2,how='right')
display(df7)

   Country  Jan_Sales  Feb_Sales
0   Canada        NaN       4000
1   Mexico     2000.0       5000
2   Brazil     3000.0       6000
3  Belgium        NaN       7000